In [1]:
# importação bibliotecas

import pandas as pd                       # importação pandas

In [2]:
# eixos

In [3]:
# importação dos dados

file = './data/drinks.csv'
drinks = pd.read_csv(file)
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'population', 'continent'],
      dtype='object')

In [4]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population,continent
0,Afghanistan,0,0,0,0.0,34.660.000,Asia
1,Albania,89,132,54,4.9,2.876.000,Europe
2,Algeria,25,0,14,0.7,40.061.000,Africa
3,Andorra,245,138,312,12.4,77.281.000,Europe
4,Angola,217,57,45,5.9,28.081.000,Africa

In [5]:
# apagando a coluna 'continent' permanentemente

drinks.drop('continent', axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population
0,Afghanistan,0,0,0,0.0,34.660.000
1,Albania,89,132,54,4.9,2.876.000
2,Algeria,25,0,14,0.7,40.061.000
3,Andorra,245,138,312,12.4,77.281.000
4,Angola,217,57,45,5.9,28.081.000

In [6]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population,continent
0,Afghanistan,0,0,0,0.0,34.660.000,Asia
1,Albania,89,132,54,4.9,2.876.000,Europe
2,Algeria,25,0,14,0.7,40.061.000,Africa
3,Andorra,245,138,312,12.4,77.281.000,Europe
4,Angola,217,57,45,5.9,28.081.000,Africa

In [7]:
# atribuindo novo dataframe a uma variável

drinks_2 = drinks.drop('continent', axis=1)

In [8]:
drinks_2.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population
0,Afghanistan,0,0,0,0.0,34.660.000
1,Albania,89,132,54,4.9,2.876.000
2,Algeria,25,0,14,0.7,40.061.000
3,Andorra,245,138,312,12.4,77.281.000
4,Angola,217,57,45,5.9,28.081.000

In [9]:
# apagando uma linha (3° registro) temporáriamente

drinks.drop(2, axis=0).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,population,continent
0,Afghanistan,0,0,0,0.0,34.660.000,Asia
1,Albania,89,132,54,4.9,2.876.000,Europe
3,Andorra,245,138,312,12.4,77.281.000,Europe
4,Angola,217,57,45,5.9,28.081.000,Africa
5,Antigua & Barbuda,102,128,45,4.9,86.295,North America

In [10]:
# axis=0: manipulando linha
# axis=1: manipulando coluna
# caso queira apagar uma linha e uma coluna, basta passar os dois parâmetros

In [11]:
# média de cada coluna

drinks.mean()

C:\Users\Caíque Miranda\AppData\Local\Temp\ipykernel_5076\2592326881.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [12]:
# média das colunas de forma explícita

drinks.mean(axis=0)

C:\Users\Caíque Miranda\AppData\Local\Temp\ipykernel_5076\1109426503.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  drinks.mean(axis=0)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [13]:
# coferindo os valores 

drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [14]:
# média de cada linha

drinks.mean(axis=1).head()

C:\Users\Caíque Miranda\AppData\Local\Temp\ipykernel_5076\1188198303.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  drinks.mean(axis=1).head()

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64

In [15]:
# 'index' é um alias(apelido) para eixo 0

drinks.mean(axis='index').head()

C:\Users\Caíque Miranda\AppData\Local\Temp\ipykernel_5076\4234381301.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  drinks.mean(axis='index').head()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [17]:
# columns é um alias(apelido) para eixo 1

drinks.mean(axis='columns').head()

C:\Users\Caíque Miranda\AppData\Local\Temp\ipykernel_5076\2902067053.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  drinks.mean(axis='columns').head()

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64

In [18]:
file = './data/eixos.csv'
eixos = pd.read_csv(file)
eixos.columns

Index(['A', 'B', 'C'], dtype='object')

In [19]:
# trabalhando com as linhas - axis=0

In [20]:
eixos.mean()

A    10.0
B     5.0
C    10.0
dtype: float64

In [21]:
eixos.mean(axis=0)

A    10.0
B     5.0
C    10.0
dtype: float64

In [22]:
eixos.mean(axis=1)

0     6.666667
1     8.333333
2    10.000000
dtype: float64

In [23]:
# trabalhando com as colunas - axis=1

In [24]:
eixos.mean(axis=1)

0     6.666667
1     8.333333
2    10.000000
dtype: float64

In [25]:
eixos.sum(axis=1)

0    20
1    25
2    30
dtype: int64

In [26]:
# eixo 0 - linhas ( r0w )
# eixo 1 - colunas ( r1nes )